tutorials/halfSphere/ChemicalEquilibriumMach50/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       16610;
    }
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       16610;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       16680;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          70;
        startFace       16800;
    }
    wedgefront
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          8400;
        startFace       16870;
    }
    wedgeback
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          8400;
        startFace       25270;
    }
)

// ************************************************************************* //
