tutorials/halfSphere/ChemicalEquilibriumMach50/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


turbulenceModel    none;  // none or baldwinLomax (experimental feature)

activateTurbulence 0.01; // time in second to activate turbulence

shockDistance			 0.1; // Estimation of the minimum distance between shock and wall

// ************************************************************************* //
