tutorials/halfSphere/ChemicalEquilibriumMach50/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

//speed of sound at sea level 340.29
//mach number M=U/a

//air properties at sea level
//p 101325
//rho 1.225
//T 288 K
//mu 0.00001789
//gamma 1.4
//R_air 287.057

internalField   uniform 270;

boundaryField
{

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }


    bottom
    {
        type             empty;
    }

    obstacle
    {
        type            zeroGradient;
    }

    wedgefront
    {
        type            wedge;
    }
    
    wedgeback
    {
        type            wedge;
    }
    
	
}

// ************************************************************************* //
